var _showNeoTrans =  ''
var _showIPATrans = ''

function localInitialise () {
	}
	

var _h = {
'2D3B': ['2D53'],
'2D53': ['2D3B'],
'2D57': ['2D42'],
'2D42': ['2D57'],
'2D5D': ['2D4B'],
'2D4B': ['2D5D'],
'2D63': ['2D65'],
'2D65': ['2D63'],
'2D61': ['2D6F'],
'2D6F': ['2D61'],
'2D62': ['2D49'],
'2D49': ['2D62'],
'2D47': ['2D3D'],
'2D3D': ['2D47'],
'2D50': ['2D4C', '2D5C'],
'2D4C': ['2D50', '2D5C'],
'2D5C': ['2D4C', '2D50'],
'2D4D': ['2D4F'],
'2D4F': ['2D4D', '2D64', '2D51'],
'2D64': ['2D4F'],
'2D5A': ['2D55', '2D41'],
'2D55': ['2D5A'],
'2D51': ['2D4F'],

end: {}
}


var keyboarddef = [
"|1,ⵒ|2,|3,|4,|5,|6,ⵤ|7,|8,«|9,»|0",
"ⴰ|ⴶ,ⵣ|ⵥ,ⴻ|ⵗ,ⵔ|ⵕ,ⵜ|ⵟ,ⵢ|ⵂ,ⵓ|ⵌ,ⵉ|ⵘ,ⵄ|ⵝ,ⵃ|ⵞ,ⵯ|ⵠ",
"ⵇ|ⵈ,ⵙ|ⵚ,ⴷ|ⴹ,ⴼ|ⴵ,ⴳ|ⴳⵯ,ⵀ|ⵁ,ⵊ|ⵋ,ⴽ|ⴽⵯ,ⵍ|ⴸ,ⵎ|ⴺ,|ⵑ",
"ⵡ|ⴾ,ⵅ|ⵆ,ⵛ|ⴿ,ⵖ|ⴴ,ⴱ|ⴲ,ⵏ|ⵐ"
]
