globals.showLOCTrans = ''
globals.showIPATrans = ''

function localInitialise () {

	}


_characterSet = 
"ئا ا ئە ە ب پ ت ج چ خ د ر ز ژ س ش غ ف ق ك گ ڭ ل م ن ھ ئو و ئۇ ۇ ئۆ ۆ ئۈ ۈ ۋ ئې ې ئى ىي ي ٠ ١ ٢ ٣ ٤ ٥ ٦ ٧ ٨ ٩ ؟ ، ؛"


var _h = {
'0627': ['06F1'],
'0622': ['06F1'],
'0623': ['06F1', '0654'],
'0625': ['06F1', '0655'],
'0671': ['06F1'],
'06F1': ['0671', '0625', '0623', '0622', '0627'],
'0639': ['060F'],
'063A': ['060F'],
'060F': ['0639', '063A'],
'0657': ['064F'],
'0602': ['060E'],
'060E': ['0602'],
'066B': ['0631'],
'0631': ['066B'],
'0654': ['0626', '0624', '0623'],
'0655': ['0625'],
'0626': ['0654'],
'0624': ['0654'],

end: {}
}





function setLocalButtons () {
	// overrides the function that hides the makeEg and charLink buttons
	
	}